tutorials/uweBourdon/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    rightHand
    {
        type            patch;
        nFaces          2500;
        startFace       367500;
    }
    outerRadius
    {
        type            patch;
        nFaces          2500;
        startFace       370000;
    }
    leftHand
    {
        type            patch;
        nFaces          2500;
        startFace       372500;
    }
    outlet
    {
        type            patch;
        nFaces          2500;
        startFace       375000;
    }
    inlet
    {
        type            patch;
        nFaces          2500;
        startFace       377500;
    }
    innerRadius
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          2500;
        startFace       380000;
    }
)

// ************************************************************************* //
