tutorials/uweBourdon/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1e-5;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    innerRadius
    {
        type            zeroGradient;
    }
    outerRadius
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
	value		uniform 1e-12;
    }
    leftHand
    {
        type            zeroGradient;
    }
    rightHand
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
